In [2]:
import pandas as pd
data = {'Name' : ["Jashim", "karim", "mita","antora"],
        'Location' : ["CTG","Dhk","Rajshahi","Barisal"],
        'Age' : [24,13,53,33]
       }

frame = pd.DataFrame(data)
display(frame)

     Name  Location  Age
0  Jashim       CTG   24
1   karim       Dhk   13
2    mita  Rajshahi   53
3  antora   Barisal   33

In [4]:
display (frame[frame.Age>30])

     Name  Location  Age
2    mita  Rajshahi   53
3  antora   Barisal   33

In [7]:
display (frame[frame.Location== "CTG"])

     Name Location  Age
0  Jashim      CTG   24

In [8]:
import numpy as np
x = np.array([1,2,3])
x

array([1, 2, 3])

In [10]:
y = np.arange (10)
y

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [29]:
a = np.array([[1,2,3,4],[5,6,7,8],[9,10,11,12]])
display (a)
b = a [:2, 0:3]
c = a [:3, 0:4]

print (b)

array([[ 1,  2,  3,  4],
       [ 5,  6,  7,  8],
       [ 9, 10, 11, 12]])

[[1 2 3]
 [5 6 7]]

In [33]:
words = ['cat','window','defense']
for w in words:
 print (w, len(w))

cat 3
window 6
defense 7